---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FilterStringBeginsWith Properties
FilterStringBeginsWith Class See Also Send Feedback
---

The FilterStringBeginsWith type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterStringRuleEvaluator.) |

# See Also

FilterStringBeginsWith Class

Autodesk.Revit.DB Namespace